{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Dense", "config": {"name": "dense", "bias_constraint": null, "dtype": "float32", "bias_regularizer": null, "use_bias": true, "batch_input_shape": [null, 12], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 35, "trainable": true, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_constraint": null, "dtype": "float32", "bias_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "trainable": true, "kernel_constraint": null}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense/kernel", "shape": [12, 35], "dtype": "float32"}, {"name": "dense/bias", "shape": [35], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [35, 10], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [10], "dtype": "float32"}]}]}